package topalgorithm.roadmap.hashtable;

public interface HashTable {
	
	/*
	 * Хеш-таблица
	 * 
	 * Операции и сложность
	 * Есть балансировка (в основном на вставку - тогда по скорости О(n) и по памяти O(n)
	 * Все операции должны выполняться в порядке O(1)
	 * Кэш имеет ограниченный размер
	 * Обязательно, чтобы все операции кэширования поддерживали параллелизм.
	 * Если кэш заполнен, добавление нового элемента должно вызывать стратегию LRU.
	 * 
	 * 
	 * Что под капотом:
	 * как формируется ключь - хэш функция
	 * колизии - как избаляется
	 * бакеты
	 * 
	 * Count sort (если нужен этот алгоритм - то скорее всего нужн использлвать
	 * хеш-таблицу) 
	 */

}
